tests/load/artillery.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - duration: 600
      arrivalRate: 50
      name: "Sustained max load"
  payload:
    path: "pageview_events.csv"
    fields:
      - "projectId"
      - "path"
      - "referrer"
      - "ua"
scenarios:
  - flow:
      - post:
          url: "/api/collect"
          json:
            projectId: "{{ projectId }}"
            path: "{{ path }}"
            referrer: "{{ referrer }}"
            ua: "{{ ua }}"