tests/load/artillery.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 600
      arrivalRate: 50
  payload:
    path: "pageview_events.csv"
    cast: false
    fields:
      - "projectId"
      - "path"
      - "referrer"
      - "ua"
scenarios:
  - flow:
      - get:
          url: "/api/collect/?projectId={{ projectId }}&path={{ path }}&referrer={{ referrer }}"
          headers:
            user-agent: "{{ ua }}"